kAMDSuccess = "No se ha producido ningún error.";
kAMDUndefinedError = "Se ha producido un error desconocido.";
kAMDBadHeaderError = "No se ha podido transferir el archivo.";
kAMDNoResourcesError = "No se ha podido asignar un recurso.";
kAMDReadError = "No se ha podido leer el dispositivo.";
kAMDWriteError = "No se ha podido escribir en el dispositivo.";
kAMDUnknownPacketError = "El paquete es desconocido.";
kAMDInvalidArgumentError = "El argumento no es válido.";
kAMDNotFoundError = "No se ha podido encontrar el archivo.";
kAMDIsDirectoryError = "La ruta es un directorio.";
kAMDPermissionError = "No dispone de permiso.";
kAMDNotConnectedError = "No hay conexión con el dispositivo.";
kAMDTimeOutError = "El tiempo de espera para la operación se ha agotado.";
kAMDOverrunError = "Hay un exceso de datos en la memoria intermedia.";
kAMDEOFError = "Final del archivo.";
kAMDUnsupportedError = "Esta operación no es compatible.";
kAMDFileExistsError = "El archivo ya existe.";
kAMDBusyError = "El dispositivo está ocupado.";
kAMDCryptoError = "No se ha podido establecer una conexión segura con el dispositivo.";
kAMDTooBigError = "El mensaje es demasiado grande.";
kAMDInvalidResponseError = "Se ha recibido una respuesta inesperada del dispositivo.";
kAMDMissingKeyError = "Falta la clave.";
kAMDMissingValueError = "Falta el valor.";
kAMDGetProhibitedError = "No se puede obtener el valor del dispositivo bloqueado con código.";
kAMDSetProhibitedError = "El valor no puede configurarse en el dispositivo.";
kAMDRemoveProhibitedError = "El valor no puede eliminarse del dispositivo.";
kAMDImmutableValueError = "Este valor no puede modificarse.";
kAMDPasswordProtectedError = "El dispositivo está protegido con código.";
kAMDMissingHostIDError = "El dispositivo no reconoce este host.";
kAMDInvalidHostIDError = "El dispositivo no reconoce este host.";
kAMDSessionActiveError = "La sesión está activa.";
kAMDSessionInactiveError = "La sesión está inactiva.";
kAMDMissingSessionIDError = "Falta el ID de sesión.";
kAMDInvalidSessionIDError = "El ID de sesión no es válido.";
kAMDMissingServiceError = "Falta el servicio.";
kAMDInvalidServiceError = "El servicio no es válido.";
kAMDServiceLimitError = "Ya se están ejecutando demasiadas instancias de este servicio.";
kAMDCheckinSetupFailedError = "No se ha podido iniciar el servicio en el dispositivo";
kAMDInvalidCheckinError = "No se ha podido iniciar el servicio en el dispositivo";
kAMDCheckinTimeoutError = "El servicio no se ha iniciado correctamente en el dispositivo.";
kAMDCheckinConnectionFailedError = "El servicio no se ha iniciado correctamente en el dispositivo.";
kAMDCheckinReceiveFailedError = "El servicio no se ha iniciado correctamente en el dispositivo.";
kAMDCheckinResponseFailedError = "El servicio no se ha iniciado correctamente en el dispositivo.";
kAMDCheckinOutOfMemoryError = "El servicio no se ha iniciado correctamente en el dispositivo.";
kAMDCheckinSendFailedError = "El servicio no se ha iniciado correctamente en el dispositivo.";
kAMDMissingPairRecordError = "El host no está enlazado con el dispositivo.";
kAMDInvalidPairRecordError = "El host ya no está enlazado con el dispositivo.";
kAMDSavePairRecordFailedError = "No se ha podido guardar el registro de enlaces.";
kAMDInvalidActivationRecordError = "El registro de activación no es válido.";
kAMDMissingActivationRecordError = "No se ha podido encontrar el registro de activación.";
kAMDServiceProhibitedError = "No se ha podido iniciar el servicio en el dispositivo.";
kAMDEscrowLockedError = "El dispositivo no estará disponible hasta que se desbloquee por primera vez después de encenderlo.";
kAMDProhibitedBySupervision = "Operación no permitida en dispositivos supervisados.";
kAMDPairingProhibitedError = "El enlace solo es posible mediante USB.";
kAMDWrongDroidError = "El dispositivo se encuentra en modo de recuperación.";
kAMDSUVerificationError = "No se ha podido verificar el paquete de actualización de software.";
kAMDSUPatchError = "No se ha podido corregir el archivo.";
kAMDSUFirmwareError = "No se ha podido actualizar el firmware.";
kAMDProvisioningProfileNotValid = "El perfil de datos no es válido.";
kAMDSendMessageError = "No se ha podido enviar un mensaje al dispositivo.";
kAMDReceiveMessageError = "No se ha podido recibir un mensaje del dispositivo.";
kAMDMissingOptionsError = "Faltan las opciones.";
kAMDMissingImageTypeError = "Falta la imagen.";
kAMDDigestFailedError = "No se ha podido leer la imagen de disco.";
kAMDStartServiceError = "No se ha podido iniciar el servicio.";
kAMDInvalidDiskImageError = "La imagen de disco no es válida.";
kAMDMissingDigestError = "Falta el procesamiento.";
kAMDMuxError = "Se ha producido un error en el multiplexor del dispositivo USB.";
kAMDApplicationAlreadyInstalledError = "El dispositivo ya tiene instalada una aplicación del sistema con este identificador de paquete y no se puede reemplazar.";
kAMDApplicationMoveFailedError = "La aplicación no se ha podido trasladar al dispositivo.";
//kAMDApplicationSINFCaptureFailedError = "";
kAMDApplicationSandboxFailedError = "No se han podido aislar los procesos de la aplicación.";
kAMDApplicationVerificationFailedError = "No se ha podido verificar la aplicación.";
kAMDArchiveDestructionFailedError = "No se ha podido eliminar el archivo comprimido de la aplicación.";
kAMDBundleVerificationFailedError = "No se ha podido verificar el paquete del operador.";
kAMDCarrierBundleCopyFailedError = "No se ha podido instalar el paquete del operador.";
kAMDCarrierBundleDirectoryCreationFailedError = "No se ha podido crear el directorio del paquete del operador.";
kAMDCarrierBundleMissingSupportedSIMsError = "No hay ninguna SIM compatible con este paquete del operador.";
kAMDCommCenterNotificationFailedError = "No se ha podido recibir ninguna notificación de la banda base.";
kAMDContainerCreationFailedError = "No se ha podido crear el contenedor de la aplicación.";
kAMDContainerP0wnFailedError = "No se han podido reparar los permisos del contenedor de la aplicación.";
kAMDContainerRemovalFailedError = "No se ha podido eliminar el contenedor de la aplicación.";
kAMDEmbeddedProfileInstallFailedError = "No se ha podido instalar el perfil de datos incorporado.";
kAMDErrorError = "Se ha producido un error.";
kAMDExecutableTwiddleFailedError = "No se han podido cambiar los permisos de la aplicación en cuanto a ejecutables.";
kAMDExistenceCheckFailedError = "No se ha podido comprobar si la aplicación ya existe.";
kAMDInstallMapUpdateFailedError = "No se ha podido actualizar la lista de aplicaciones instaladas.";
kAMDManifestCaptureFailedError = "No se ha podido guardar el manifiesto de la aplicación.";
kAMDMapGenerationFailedError = "No se ha podido generar el mapa.";
kAMDMissingBundleExecutableError = "El paquete de la aplicación no contiene ningún ejecutable.";
kAMDMissingBundleIdentifierError = "El paquete de la aplicación no contiene ningún identificador válido.";
kAMDMissingBundlePathError = "No se ha podido determinar la ruta del paquete de la aplicación.";
kAMDMissingContainerError = "No se ha podido encontrar el contenedor de la aplicación instalada.";
kAMDNotificationFailedError = "No se ha podido enviar una notificación.";
kAMDPackageExtractionFailedError = "No se ha podido abrir el paquete de la aplicación.";
kAMDPackageInspectionFailedError = "No se ha podido inspeccionar el paquete de la aplicación.";
kAMDPackageMoveFailedError = "No se ha podido trasladar el paquete de la aplicación a la ubicación temporal.";
kAMDPathConversionFailedError = "No se ha podido convertir la ruta.";
kAMDRestoreContainerFailedError = "No se ha podido restaurar el contenedor de la aplicación.";
kAMDSeatbeltProfileRemovalFailedError = "No se ha podido eliminar el perfil Seatbelt de la aplicación.";
kAMDStageCreationFailedError = "No se ha podido crear el directorio temporal.";
kAMDSymlinkFailedError = "No se ha podido crear el enlace simbólico.";
kAMDiTunesArtworkCaptureFailedError = "No se ha podido guardar la ilustración de iTunes.";
kAMDiTunesMetadataCaptureFailedError = "No se han podido guardar los metadatos de iTunes.";
kAMDAlreadyArchivedError = "Esta aplicación ya se ha comprimido.";
kAMDUnknownCommandError = "El dispositivo no reconoce el comando.";
kAMDAPIInternalError = "Se ha producido un error interno API.";
kAMDMuxCreateListenerError = "No se ha podido detectar ningún dispositivo USB.";
kAMDMuxGetListenerError = "No se ha podido detectar el receptor USB.";
kAMDMuxConnectError = "No se ha podido establecer conexión con el dispositivo.";
kAMDDeviceTooNewError = "Esta aplicación debe actualizarse.";
kAMDDeviceRefNoGood = "Este dispositivo ya no está conectado.";
kAMDDeviceDisconnectedError = "Este dispositivo ya no está conectado.";
kAMDCannotTranslateError = "No se han podido traducir los mensajes del dispositivo";
kAMDMobileImageMounterMissingImageSignature = "Desarrollo incompatible.";
kAMDMobileImageMounterResponseCreationFailed = "Desarrollo incompatible.";
kAMDMobileImageMounterMissingImageType = "Desarrollo incompatible.";
kAMDMobileImageMounterMissingImagePath = "Desarrollo incompatible.";
kAMDMobileImageMounterImageMapLoadFailed = "Desarrollo incompatible.";
kAMDMobileImageMounterAlreadyMounted = "Desarrollo incompatible.";
kAMDMobileImageMounterImageMoveFailed = "Desarrollo incompatible.";
kAMDMobileImageMounterMountPathMissing = "Desarrollo incompatible.";
kAMDMobileImageMounterMountPathNotEmpty = "Desarrollo incompatible.";
kAMDMobileImageMounterImageMountFailed = "Desarrollo incompatible.";
kAMDMobileImageMounterTrustCacheLoadFailed = "Desarrollo incompatible.";
kAMDMobileImageMounterDigestFailed = "Desarrollo incompatible.";
kAMDMobileImageMounterDigestCreationFailed = "Desarrollo incompatible.";
kAMDMobileImageMounterImageVerificationFailed = "Desarrollo incompatible.";
kAMDMobileImageMounterImageInfoCreationFailed = "Desarrollo incompatible.";
kAMDMobileImageMounterImageMapStoreFailed = "Desarrollo incompatible.";
kAMDDeviceOSVersionTooLow = "La versión del sistema operativo del dispositivo no es suficientemente reciente.";
kAMDNoWifiSyncSupportError = "El dispositivo no admite la sincronización inalámbrica.";
kAMDDeviceFamilyNotSupported = "Esta aplicación no es compatible con este tipo de dispositivo.";
kAMDPackagePatchFailedError = "No se ha podido aplicar la actualización de corrección a la aplicación.";
kAMDIncorrectArchitectureError = "Esta aplicación no es compatible con el tipo de CPU de este dispositivo.";
kAMDPluginCopyFailedError = "No se ha podido copiar el módulo VPN en el contenedor de la aplicación.";
kAMDBreadcrumbFailedError = "No se ha podido escribir en el rastro de la instalación.";
kAMDBreadcrumbUnlockError = "No se ha podido actualizar el rastro de la instalación.";
kAMDGeoJSONCaptureFailedError = "No se han podido guardar los datos GeoJSON.";
kAMDNewsstandArtworkCaptureFailedError = "No se ha podido guardar la ilustración de Quiosco.";
kAMDMissingCommandError = "La solicitud no contenía un comando.";
kAMDNotEntitledError = "La aplicación que realiza la solicitud no está autorizada a hacer este tipo de solicitud.";
kAMDMissingPackagePathError = "Faltaba la ruta del paquete en la solicitud.";
kAMDMissingContainerPathError = "Faltaba la ruta del contenedor en la solicitud.";
kAMDMissingApplicationIdentifierError = "Faltaba el identificador de la aplicación en la solicitud.";
kAMDMissingAttributeValueError = "Faltaba un valor necesario en la solicitud.";
kAMDLookupFailedError = "No se ha podido crear la lista de aplicaciones instaladas.";
kAMDDictCreationFailedError = "No se han podido extraer las posibilidades de la solicitud.";

/* kMISFileError */
"A file operation failed." = "Error en una operación de archivo.";

/* kMISModifiedResourcesError */
"A signed resource has been added, modified, or deleted." = "Se ha añadido, modificado o eliminado un recurso firmado.";

/* kMISInvalidSignerError */
"A valid provisioning profile for this executable was not found." = "No se encuentra ningún perfil de datos válido para este ejecutable.";

/* kMISUnknownError */
"An unknown error has occurred." = "Se ha producido un error desconocido.";

/* kMISNotMutableError */
"Attempted to modify an immutable provisioning profile." = "Se ha intentado modificar un perfil de datos inalterable.";

/* kMISApplicationSignatureNotValidError */
"The application does not have a valid signature." = "La aplicación no dispone de ninguna firma válida.";

/* kMISApplicationSignatureNotValidError */
"The application's signature is valid but it does not match the expected hash." = "La firma de la aplicación es válida pero no coincide con los datos esperados.";

/* kMISAdHocSignatureError */
"The executable contains an invalid signature." = "La firma del ejecutable no es válida.";

/* kMISInvalidEntitlementError */
"The executable was signed with invalid entitlements." = "El ejecutable se ha firmado con una autorización no válida.";

/* kMISInvalidSignerCertError */
"The identity used to sign the executable is no longer valid." = "La identidad usada para firmar el ejecutable ya no es válida.";

/* kMISSignatureNotValidError */
"The signature was not valid." = "La firma no era válida.";

/* kMISConnectionClosedError */
"There was an error communicating with your device." = "Se ha producido un error de comunicación con el dispositivo.";

/* kMISUnsupportedDeviceError */
"This provisioning profile cannot be installed on this device." = "Este perfil de datos no puede instalarse en el dispositivo.";

/* kMISProfileSignatureNotValidError */
"This provisioning profile does not have a valid signature (or it has a valid, but untrusted signature)." = "Este perfil de datos no dispone de ninguna firma válida (o dispone de una firma válida pero no fiable).";

/* kMISExpiredError */
"This provisioning profile has expired." = "Este perfil de datos ha caducado.";

/* kMISMalformedProfileError */
"This provisioning profile is malformed." = "El formato de este perfil de datos es incorrecto.";

/* kMISUnsupportedVersionError */
"This provisioning profile is unsupported." = "Este perfil de datos es incompatible.";

/* kMISAllocationError */
"Unable to allocate memory." = "No se ha podido asignar memoria.";

